# IFCImportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions Constructor
IFCImportOptions Class See Also
---
Constructs a new IFCImportOptions using default settings.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IFCImportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
IFCImportOptions()
```

# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace